adafruit/circuitpython/ports/raspberrypi/boards/grumpy-sloth_slim-sloth-108/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Grumpy Sloth - Slim Sloth"
#define MICROPY_HW_MCU_NAME "rp2040"
#define BOARD_HAS_CRYSTAL 1